Switched from PlantUML to Mermaid
