--- a/assignment/06-monitoring.md
+++ b/assignment/06-monitoring.md
@@ -4,54 +4,56 @@ In this lab, you'll setup a monitoring solution based on [Prometheus](https://pr
 
 First, you'll create a mock model in Python that spits out test values in the interval [0, 1] every 5 seconds, set up Prometheus to gather the metric from the mocked model, visualize the metric from the model mock using Grafana, and use Alert manager to get notifications on Discord when the metric of the model reaches a certain threshold.
 
-```plantuml
-@startuml
-node "Host" {
-  [modelmock.py]
+```mermaid
+flowchart
+    subgraph host
+        mm[modelmock.py]
 
-  node "Docker" {
-    [Prometheus]
-    [Grafana]
-    [AlertManager]
-  }
-}
+        mm --> p
 
-cloud "Internet" {
-    [Discord]
-}
+        subgraph Docker
+            p[Prometheus]
+            g[grafana]
+            am[AlertManager]
 
-[modelmock.py] --> [Prometheus]
-[Prometheus] --> [Grafana]
-[Prometheus] --> [AlertManager]
-[AlertManager] --> [Discord]
-@enduml
+            p --> g
+            p --> am
+        end
+    end
+
+    subgraph internet
+        d[Discord]
+
+        am --> d
+    end
 ```
 
 Next, we'll create a VM and start monitoring various metrics of that VM such as CPU usage thanks to Node Exporter. If the VM shows abnormal activity, we'll again receive notifications on Discord.
 
-```plantuml
-@startuml
-node "Host" {
-  node "Docker" {
-    [Prometheus]
-    [Grafana]
-    [AlertManager]
-  }
+```mermaid
+flowchart
+    subgraph host
+        subgraph Docker
+            p[Prometheus]
+            g[grafana]
+            am[AlertManager]
 
-  node "VM" {
-    [Node Exporter]
-  }
-}
+            p --> g
+            p --> am
+        end
 
-cloud "Internet" {
-    [Discord]
-}
+        subgraph VM
+            ne[Node exporter]
 
-[Node Exporter] --> [Prometheus]
-[Prometheus] --> [Grafana]
-[Prometheus] --> [AlertManager]
-[AlertManager] --> [Discord]
-@enduml
+            ne --> p
+        end
+    end
+
+    subgraph internet
+        d[Discord]
+
+        am --> d
+    end
 ```
 
 ## :mortar_board: Learning Goals
